app/views/clubs/index.html.erb

SELECT "players".* FROM "players"  WHERE "players"."club_id" = ?  [["club_id", 1]]
---
	<%= club.club_name %><br/>
	<% club.players.each do |player| %>