app/views/clubs/show.html.erb

SELECT "articles".* FROM "articles"  WHERE "articles"."club_id" = ?  [["club_id", 1]]
---
                <h2>Articles:</h2>
            	<% @club.articles.each do |article| %>