app/views/players/show.html.erb

                <h2>Articles:</h2>
                <% @player.articles.each do |article| %>
---
SELECT "articles".* FROM "articles"  WHERE "articles"."player_id" = ?  [["player_id", 4]]