app/controllers/admin_controller.rb

SELECT "players".* FROM "players"
SELECT "clubs".* FROM "clubs"
SELECT "users".* FROM "users"
---
	def index
		@players = Player.all
		@clubs = Club.all
		@users = User.all