app/controllers/articles_controller.rb

INSERT INTO "articles" ("article_big", "article_image", "article_small", "article_title", "club_id", "created_at", "player_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)
    if @article.save