app/controllers/clubs_controller.rb

SELECT "clubs".* FROM "clubs"
---
  def index
  	@clubs = Club.all

SELECT  "clubs".* FROM "clubs"  WHERE "clubs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @club = Club.find(params[:id])

INSERT INTO "clubs" ("club_assists", "club_goals", "club_name", "club_position", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["club_assists", "21"], ["club_goals", "41"], ["club_name", "Chelsea"], ["club_position", "3"], ["created_at", "2014-07-23 23:13:42.012613"], ["updated_at", "2014-07-23 23:13:42.012613"]]
---
  def create
  	@club = Club.new(club_params)

  	if @club.save