app/controllers/players_controller.rb

INSERT INTO "players" ("club_id", "created_at", "player_name", "updated_at") VALUES (?, ?, ?, ?)  [["club_id", 1], ["created_at", "2014-07-17 07:23:17.075167"], ["player_name", "Wayne Rooney"], ["updated_at", "2014-07-17 07:23:17.075167"]]
---
  def create
  	@player = Player.new(player_params)

  	if @player.save